valtlInf/xensiv-magnetic-sensors-sw-examples/Angle-Sensors/Aurix/TLE5502/TLE5502_TC334_IntegrationExample/TLE5502_AurixCalibOnGo/Libraries/Infra/Sfr/TC33x/IfxDma_bf.h
/** \brief Offset for Ifx_DMA_ACCEN_ACCENR0_Bits.EN26 */
#define IFX_DMA_ACCEN_ACCENR0_EN26_OFF (26u)

/** \brief Length for Ifx_DMA_ACCEN_ACCENR0_Bits.EN27 */
#define IFX_DMA_ACCEN_ACCENR0_EN27_LEN (1u)

/** \brief Mask for Ifx_DMA_ACCEN_ACCENR0_Bits.EN27 */
#define IFX_DMA_ACCEN_ACCENR0_EN27_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ACCEN_ACCENR0_Bits.EN27 */
#define IFX_DMA_ACCEN_ACCENR0_EN27_OFF (27u)

/** \brief Length for Ifx_DMA_ACCEN_ACCENR0_Bits.EN28 */
#define IFX_DMA_ACCEN_ACCENR0_EN28_LEN (1u)

/** \brief Mask for Ifx_DMA_ACCEN_ACCENR0_Bits.EN28 */
#define IFX_DMA_ACCEN_ACCENR0_EN28_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ACCEN_ACCENR0_Bits.EN28 */
#define IFX_DMA_ACCEN_ACCENR0_EN28_OFF (28u)

/** \brief Length for Ifx_DMA_ACCEN_ACCENR0_Bits.EN29 */
#define IFX_DMA_ACCEN_ACCENR0_EN29_LEN (1u)

/** \brief Mask for Ifx_DMA_ACCEN_ACCENR0_Bits.EN29 */
#define IFX_DMA_ACCEN_ACCENR0_EN29_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ACCEN_ACCENR0_Bits.EN29 */
#define IFX_DMA_ACCEN_ACCENR0_EN29_OFF (29u)

/** \brief Length for Ifx_DMA_ACCEN_ACCENR0_Bits.EN30 */
#define IFX_DMA_ACCEN_ACCENR0_EN30_LEN (1u)

/** \brief Mask for Ifx_DMA_ACCEN_ACCENR0_Bits.EN30 */
#define IFX_DMA_ACCEN_ACCENR0_EN30_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ACCEN_ACCENR0_Bits.EN30 */
#define IFX_DMA_ACCEN_ACCENR0_EN30_OFF (30u)

/** \brief Length for Ifx_DMA_ACCEN_ACCENR0_Bits.EN31 */
#define IFX_DMA_ACCEN_ACCENR0_EN31_LEN (1u)

/** \brief Mask for Ifx_DMA_ACCEN_ACCENR0_Bits.EN31 */
#define IFX_DMA_ACCEN_ACCENR0_EN31_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ACCEN_ACCENR0_Bits.EN31 */
#define IFX_DMA_ACCEN_ACCENR0_EN31_OFF (31u)

/** \brief Length for Ifx_DMA_ME_EER_Bits.ESER */
#define IFX_DMA_ME_EER_ESER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_EER_Bits.ESER */
#define IFX_DMA_ME_EER_ESER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_EER_Bits.ESER */
#define IFX_DMA_ME_EER_ESER_OFF (16u)

/** \brief Length for Ifx_DMA_ME_EER_Bits.EDER */
#define IFX_DMA_ME_EER_EDER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_EER_Bits.EDER */
#define IFX_DMA_ME_EER_EDER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_EER_Bits.EDER */
#define IFX_DMA_ME_EER_EDER_OFF (17u)

/** \brief Length for Ifx_DMA_ME_EER_Bits.ELER */
#define IFX_DMA_ME_EER_ELER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_EER_Bits.ELER */
#define IFX_DMA_ME_EER_ELER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_EER_Bits.ELER */
#define IFX_DMA_ME_EER_ELER_OFF (26u)

/** \brief Length for Ifx_DMA_ME_ERRSR_Bits.LEC */
#define IFX_DMA_ME_ERRSR_LEC_LEN (7u)

/** \brief Mask for Ifx_DMA_ME_ERRSR_Bits.LEC */
#define IFX_DMA_ME_ERRSR_LEC_MSK (0x7fu)

/** \brief Offset for Ifx_DMA_ME_ERRSR_Bits.LEC */
#define IFX_DMA_ME_ERRSR_LEC_OFF (0u)

/** \brief Length for Ifx_DMA_ME_ERRSR_Bits.SER */
#define IFX_DMA_ME_ERRSR_SER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_ERRSR_Bits.SER */
#define IFX_DMA_ME_ERRSR_SER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_ERRSR_Bits.SER */
#define IFX_DMA_ME_ERRSR_SER_OFF (16u)

/** \brief Length for Ifx_DMA_ME_ERRSR_Bits.DER */
#define IFX_DMA_ME_ERRSR_DER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_ERRSR_Bits.DER */
#define IFX_DMA_ME_ERRSR_DER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_ERRSR_Bits.DER */
#define IFX_DMA_ME_ERRSR_DER_OFF (17u)

/** \brief Length for Ifx_DMA_ME_ERRSR_Bits.SPBER */
#define IFX_DMA_ME_ERRSR_SPBER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_ERRSR_Bits.SPBER */
#define IFX_DMA_ME_ERRSR_SPBER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_ERRSR_Bits.SPBER */
#define IFX_DMA_ME_ERRSR_SPBER_OFF (20u)

/** \brief Length for Ifx_DMA_ME_ERRSR_Bits.SRIER */
#define IFX_DMA_ME_ERRSR_SRIER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_ERRSR_Bits.SRIER */
#define IFX_DMA_ME_ERRSR_SRIER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_ERRSR_Bits.SRIER */
#define IFX_DMA_ME_ERRSR_SRIER_OFF (21u)

/** \brief Length for Ifx_DMA_ME_ERRSR_Bits.RAMER */
#define IFX_DMA_ME_ERRSR_RAMER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_ERRSR_Bits.RAMER */
#define IFX_DMA_ME_ERRSR_RAMER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_ERRSR_Bits.RAMER */
#define IFX_DMA_ME_ERRSR_RAMER_OFF (24u)

/** \brief Length for Ifx_DMA_ME_ERRSR_Bits.SLLER */
#define IFX_DMA_ME_ERRSR_SLLER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_ERRSR_Bits.SLLER */
#define IFX_DMA_ME_ERRSR_SLLER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_ERRSR_Bits.SLLER */
#define IFX_DMA_ME_ERRSR_SLLER_OFF (25u)

/** \brief Length for Ifx_DMA_ME_ERRSR_Bits.DLLER */
#define IFX_DMA_ME_ERRSR_DLLER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_ERRSR_Bits.DLLER */
#define IFX_DMA_ME_ERRSR_DLLER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_ERRSR_Bits.DLLER */
#define IFX_DMA_ME_ERRSR_DLLER_OFF (26u)

/** \brief Length for Ifx_DMA_ME_CLRE_Bits.CSER */
#define IFX_DMA_ME_CLRE_CSER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CLRE_Bits.CSER */
#define IFX_DMA_ME_CLRE_CSER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_CLRE_Bits.CSER */
#define IFX_DMA_ME_CLRE_CSER_OFF (16u)

/** \brief Length for Ifx_DMA_ME_CLRE_Bits.CDER */
#define IFX_DMA_ME_CLRE_CDER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CLRE_Bits.CDER */
#define IFX_DMA_ME_CLRE_CDER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_CLRE_Bits.CDER */
#define IFX_DMA_ME_CLRE_CDER_OFF (17u)

/** \brief Length for Ifx_DMA_ME_CLRE_Bits.CSPBER */
#define IFX_DMA_ME_CLRE_CSPBER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CLRE_Bits.CSPBER */
#define IFX_DMA_ME_CLRE_CSPBER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_CLRE_Bits.CSPBER */
#define IFX_DMA_ME_CLRE_CSPBER_OFF (20u)

/** \brief Length for Ifx_DMA_ME_CLRE_Bits.CSRIER */
#define IFX_DMA_ME_CLRE_CSRIER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CLRE_Bits.CSRIER */
#define IFX_DMA_ME_CLRE_CSRIER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_CLRE_Bits.CSRIER */
#define IFX_DMA_ME_CLRE_CSRIER_OFF (21u)

/** \brief Length for Ifx_DMA_ME_CLRE_Bits.CRAMER */
#define IFX_DMA_ME_CLRE_CRAMER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CLRE_Bits.CRAMER */
#define IFX_DMA_ME_CLRE_CRAMER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_CLRE_Bits.CRAMER */
#define IFX_DMA_ME_CLRE_CRAMER_OFF (24u)

/** \brief Length for Ifx_DMA_ME_CLRE_Bits.CSLLER */
#define IFX_DMA_ME_CLRE_CSLLER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CLRE_Bits.CSLLER */
#define IFX_DMA_ME_CLRE_CSLLER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_CLRE_Bits.CSLLER */
#define IFX_DMA_ME_CLRE_CSLLER_OFF (25u)

/** \brief Length for Ifx_DMA_ME_CLRE_Bits.CDLLER */
#define IFX_DMA_ME_CLRE_CDLLER_LEN (1u)

/** \brief Mask for Ifx_DMA_ME_CLRE_Bits.CDLLER */
#define IFX_DMA_ME_CLRE_CDLLER_MSK (0x1u)

/** \brief Offset for Ifx_DMA_ME_CLRE_Bits.CDLLER */
#define IFX_DMA_ME_CLRE_CDLLER_OFF (26u)

